MyHome/src/Enums/мх_ТипыКошельковИСчетов/мх_ТипыКошельковИСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мх_ТипыКошельковИСчетов</name>
  <enumValues>
    <name>Наличность</name>
  </enumValues>
  <enumValues>
    <name>ДебетоваяБанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>КредитнаяБанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКошелек</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

MyHome/src/Enums/мх_ТипыКошельковИСчетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ТипыКошельковСобственныхСредств() Экспорт

	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.мх_ТипыКошельковИСчетов.БанковскийСчет"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.мх_ТипыКошельковИСчетов.ДебетоваяБанковскаяКарта"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.мх_ТипыКошельковИСчетов.Наличность"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.мх_ТипыКошельковИСчетов.ЭлектронныйКошелек"));
	
	Возврат МассивТипов;
	
КонецФункции

Функция ТипыКошельковЗаемныхСредств() Экспорт
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.мх_ТипыКошельковИСчетов.КредитнаяБанковскаяКарта"));
	
	Возврат МассивТипов;
	
КонецФункции		

#КонецЕсли
